       PARAGRAPH1.
           GO TO PARAGRAPH4
           STOP RUN.





      *I am line 9 and I don't have any PERFORM statements

       PARAGRAPH4.
           DISPLAY "In PARAGRAPH4".
           STOP RUN.