       IDENTIFICATION DIVISION.
       PROGRAM-ID. MinimalProgram.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(4) VALUE 0.
       01 B PIC 9(4) VALUE 0.
       01 SOMETHING PIC X VALUE 'N'.
       01 SOMETHING-ELSE PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM PARAGRAPH1 THRU PARAGRAPH3
           EXIT PROGRAM.

       COPY BB.