       IDENTIFICATION DIVISION.
       PROGRAM-ID. MinimalProgram.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SOMETHING PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM PARAGRAPH1
           EXIT PROGRAM.

       COPY BB.